---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelText
source: html/3fe92712-fbe1-3826-b93a-c8744fdaefd7.htm
---
# ModelText Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.